---
kind: method
id: M:Autodesk.Revit.DB.AdaptiveComponentFamilyUtils.IsAdaptiveComponentFamily(Autodesk.Revit.DB.Family)
source: html/f3335479-cb8c-8a3e-3a84-48354825a501.htm
---
# Autodesk.Revit.DB.AdaptiveComponentFamilyUtils.IsAdaptiveComponentFamily Method

Verifies if the Family is an Adaptive Component Family.

## Syntax (C#)
```csharp
public static bool IsAdaptiveComponentFamily(
	Family family
)
```

## Parameters
- **family** (`Autodesk.Revit.DB.Family`) - The Family

## Returns
True if the Family is an Adaptive Component Family.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null